<?php
return array(
// +----------------------------------------------------------------------
    // | 缓存设置
    // +----------------------------------------------------------------------

    'cache'                  => [
        // 驱动方式 支持redis memcache memcached
        'type' => 'redis',
        //'host' => '172.31.99.3',//线下
        'host' => '127.0.0.1',
        // 缓存保存目录
        // 'path' => CACHE_PATH,
        // 缓存前缀
        'prefix' => 'allwin',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
        'password' => 'qq420984',
        'select' => '0',
    ],
);