<?php
return array(
    'log_action' => [
        1 => '取消合伙人',
        2 => '设置合伙人',
        //3 => '禁用会员提现',
        //4 => '开启会员提现',
        //5 => '清空用户不良次数',
        6 => '会员修改密码',
        //7 => '会员清空实名',
        8 => '会员修改手机',
        9 => '会员修改昵称',
        //10 => '会员节点状态',
        //11 => '会员超级节点状态',
        12 => '修改匹配级别',
        13 => '修改股东分成',


//        21 => '重置提现订单',
        22 => '提现审核拒绝',
        23 => '提现审核通过',

//        31 => '审核兑换通证',
//        32 => '审核通证兑换',

//        41 => '后台充值AWT',
//        42 => '后台扣除AWT',
//
//        43 => '添加众筹',


        91 => '新增参数',
        92 => '修改参数',
        93 => '删除参数',

        95 => '新增公告',
        96 => '修改公告',
        97 => '公告禁启用',
        98 => '公告删除',

        201 => '广告类型添加',
        202 => '广告类型修改',
        203 => '广告类型删除',
        204 => '广告添加',
        205 => '广告修改',
        206 => '广告删除',
        207 => '广告状态',

        //209 => 'token禁止兑换',
        //210 => 'token开启兑换',
        211 => 'token新增',
        212 => 'token编辑',
        213 => 'token删除',
        214 => 'token批量删除',
        215 => 'token禁用',
        216 => 'token开启',
        //217 => 'token禁止充值',
        //218 => 'token开启充值',
        //219 => 'token禁止提现',
        //220 => 'token开启提现',

        221 => '添加价格',
        222 => '修改价格',
        223 => '删除价格',

//        226 => '添加锁仓钱包等级',
//        227 => '修改锁仓钱包等级',
//        228 => '删除锁仓钱包等级',
//
//        231 => '添加超级节点等级',
//        232 => '修改超级节点等级',
//        233 => '删除超级节点等级',
//        234 => '开启超级节点等级',
//        235 => '关闭超级节点等级',

//        241 => '添加折扣',
//        242 => '修改折扣',
//        243 => '删除折扣',
//        244 => '开启折扣',
//        245 => '关闭折扣',


//        261 => '添加帮助',
//        262 => '修改帮助',
//        263 => '删除帮助',

        416 => '修改登录密码',
        417 => '设置交易密码',
        288 => '强制交易',
        289 => '强制撤销',

//        297 => '添加国家配置',
//        298 => '修改国家配置',
//        299 => '删除国家配置',
//        300 => '国家配置状态更改',

        520 => '身份认证审核',

//        310 => '理财套餐配置增加',
//        311 => '理财套餐配置编辑',
//        312 => '理财套餐配置删除',
//        313 => '理财套餐体验启停',

        339 => '匹配比例禁止',
        340 => '匹配比例开启',
        341 => '匹配比例新增',
        342 => '匹配比例编辑',

        325 => '管理员增加减少',


    ],

    'log_coin' => [
        //1-50 为减少余额   51-100增加余额
        1 => '挂买-卖出',
        2 => '挂卖-买入',
        8 => '提现',

        11 => '上午场买入消耗',//手续费
        12 => '上午场卖出消耗',

        13 => '下午场买入消耗',
        14 => '下午场卖出消耗',

        21 => '转出',

        31 => '兑换减少',

        41 => '管理员扣除',

        44 => 'OTC出售',

        51 => '卖单-撤销',
        52 => '挂买-买入',
        53 => '挂卖-买入',
        54 => '自动-撤销',
        55 => '管理员-撤销', //后台强制撤销

        56 => '管理员-确认',//后台强制执行卖出

        58 => '提现-撤销', //后台撤销

        59 => '下午场买入获得',
        60 => '下午场卖出获得',

        61 => '上午场买入获得',
        62 => '上午场卖出获得',

        63 => '上午场撤销返还',
        64 => '上午场撤销返还',
        65 => '下午场撤销返还',
        66 => '下午场撤销返还',

        67 => '下级交易手续费奖励',

        68 => '入金分红提取',
        69 => '推广获得',
        70 => '购买赠送',

        71 => '转入',

        81 => '管理员增加',
        82 => 'FID会员赠送',
        88 => '充值',

        90 => '市场激励分红',
        91 => 'FID股东分成',
        99 => '扫码注册赠送',

        111 => '兑换增加',

        120 => 'OTC购买',
        121 => 'OTC出售退还',

        130 => '1代级差奖励',
        131 => '2代级差奖励',
    ],

    'user_payment' => [
        1 => '支付宝',
        2 => '微信',
        3 => '银行卡',
    ],

    'trade' => [
        0 => '未成交',
        1 => '部分成交',
        2 => '已成交',
        -1 => '已撤销',
    ],

    'user_recharge' => [
        1 => '储蓄钱包',
        2 => '众筹钱包',
    ],

    'log_temp' => [
        // temp  type 880－885为减少 887－891 为增加
        880 => '锁仓|Locked',//转入锁仓钱包
        881 => '转账|Send',//出售给会员
        882 => '扣除|Deduct',//后台扣除

        887 => '兑换|Exchange',//排队兑换
        888 => '转入|TransferIn',//活动钱包转入
        889 => '收款|Receive',//购买
        890 => '超级节点|Super node',//超级节点得取
        891 => '充值|Recharge',//后台充值
        899 => '补充超级节点|Recharge',//后台充值

    ],

    'log_activity' => [
        //temp  type 660－665为减少 666-669 为增加
        660 => '兑换|Exchange',//兑换货币提现
        661 => '转出|Transfer out',//转出到临时钱包
        662 => '复投|Supplementary super node',//复投锁仓

        666 => '释放|Release',//锁仓释放
        668 => '我的节点|My node',//我的节点得取
        669 => '退还|Refund',


    ],
    'market' => [
        1 => '挂买',
        2 => '挂卖',
    ],
    'market1' => [
        0 => '未成交',
        1 => '部分成交',
        2 => '已成交',
        -1 => '已撤销',
    ],
    'trx_eth' => [
        0 => '未入账',
        1 => '已入账',
    ],

    'log_trade' => [
        1 => '已完成',
    ],

    'log_crowd' => [
        1 => '众筹充值',
        2 => '众筹提取',
        11 => '众筹释放',
    ],

    'log_market' => [
        1 => '卖家卖出等待买家付款',
        2 => '买家付款等待卖家确认',
        3 => '卖家确认订单完成',
        11 => '卖家接单等待卖家付款',
        12 => '买家付款并上传凭证等待卖家确认',
        13 => '卖家确认订单完成',
        -1 => '已撤销',
    ],


    'user_lock' => [
        0 => '已结束',
        1 => '进行中',
        2 => '已提取',
    ],

    'savings' => [
        //type 1－10为增加 11-20 为减少
        1 => '转入',
        2 => '众筹钱包提取',
        3 => '超级节点提取',
        4 => '推广收益提取',
        5 => '理财钱包提取',

        7 => '会员互转增加',
        10 => '后台充值',


        11 => '转出',
        12 => '理财',
        17 => '会员互转减少',
        20 => '后台扣除',
    ],

    'user_warn' => [
        1 => '警告',
        2 => '严重警告',
    ],
    'user_warn1' => [
        0 => '失效',
        1 => '生效',
    ],

    'log_change_payment' => [
        1 => '微信',
        2 => '支付宝',
        3 => '银行卡'
    ],

    'trx_coin' => [
        0 => '未确认',
        1 => '确认',
        2 => '已到账'
    ],

);